Repository: wpcodefactory/popup-notices-for-woocommerce
Catalog: src/languages/popup-notices-for-woocommerce-*.po
Languages: ru_ru

source: Pop-up Notices
ru_ru: Всплывающие уведомления

source: General
ru_ru: Общие настройки

source: Compatibility
ru_ru: Совместимость

source: Pop-up Notices General Options
ru_ru: Всплывающие уведомления Общие параметры

source: Enable Plugin
ru_ru: Включить плагин

source: Enable %s plugin
ru_ru: Включить плагин %s

source: Pop-up Notices for WooCommerce
ru_ru: Всплывающие уведомления для WooCommerce

source: Device types
ru_ru: Типы устройств

source: Enable the plugin by device type.
ru_ru: Включите плагин по типу устройства.

source: Leave it empty to load the plugin in all device types.
ru_ru: Оставьте его пустым, чтобы загрузить плагин на всех типах устройств.

source: Mobile
ru_ru: Мобильный

source: Desktop
ru_ru: Рабочий стол

source: AJAX pop-up
ru_ru: Всплывающее окно AJAX

source: Display Pop-up notices from AJAX requests
ru_ru: Отображать всплывающие уведомления из AJAX-запросов

source: Notices displayed without reloading the page.
ru_ru: Уведомления отображаются без перезагрузки страницы.

source: e.g Error notices displayed on cart update or if something goes wrong in checkout.
ru_ru: например, уведомления об ошибках отображаются при обновлении корзины или если что-то идет не так при оформлении заказа.

source: Close on click inside
ru_ru: Закрыть по щелчку внутри

source: Close popup if a button or a link is clicked inside the popup
ru_ru: Закрыть всплывающее окно, если внутри всплывающего окна нажата кнопка или ссылка

source: Prevent closing if clicking outside
ru_ru: Предотвратить закрытие при нажатии снаружи

source: Prevent closing the popup when clicking on the overlay outside the popup
ru_ru: Предотвратить закрытие всплывающего окна при нажатии на наложение вне всплывающего окна

source: If it doesn't work, try to remove the %s attribute from the %s div from the %s option.
ru_ru: Если это не сработает, попробуйте удалить атрибут %s из %s div из опции %s.

source: Modal template
ru_ru: Модальный шаблон

source: Prevent scrolling
ru_ru: Предотвратить прокрутку

source: Prevent scrolling when WooCommerce displays notices
ru_ru: Запретить прокрутку, когда WooCommerce отображает уведомления

source: Only works for AJAX notices.
ru_ru: Работает только для уведомлений AJAX.

source: Micromodal loading method
ru_ru: Способ микромодальной загрузки

source: How the micromodal library is going to be loaded.
ru_ru: Как будет загружена микромодальная библиотека.

source: Micromodal is the library responsible for the popups.
ru_ru: Micromodal - это библиотека, ответственная за всплывающие окна.

source: Externally from unpkg.com
ru_ru: Внешне от unpkg.com

source: Locally
ru_ru: Локально

source: Notice types
ru_ru: Типы уведомлений

source: Notice types that can be displayed on Pop-ups
ru_ru: Типы уведомлений, которые могут отображаться во всплывающих окнах

source: Enable error notices
ru_ru: Включить уведомления об ошибках

source: Enable success notices
ru_ru: Включить уведомления об успешном завершении

source: Enable info notices
ru_ru: Включить информационные уведомления

source: Notice hiding
ru_ru: Заметьте, что скрывается

source: Hide default WooCommerce Notices.
ru_ru: Скрыть уведомления WooCommerce по умолчанию.

source: Hide error notices
ru_ru: Скрыть уведомления об ошибках

source: Hide success notices
ru_ru: Скрыть уведомления об успехе

source: Hide info notices
ru_ru: Скрыть информационные уведомления

source: Auto-close
ru_ru: Автозакрытие

source: Auto-closes the popup after x seconds.
ru_ru: Автоматически закрывает всплывающее окно через x секунд.

source: Auto-close time
ru_ru: Время автоматического закрытия

source: Leave it empty to disable auto-close.
ru_ru: Оставьте его пустым, чтобы отключить автоматическое закрытие.

source: Only pop-ups containing at least one of the selected notice types will auto-close.
ru_ru: Автоматически закроются только всплывающие окна, содержащие хотя бы один из выбранных типов уведомлений.

source: If empty, the auto-close will work regardless of the notice type.
ru_ru: Если пусто, автоматическое закрытие будет работать независимо от типа уведомления.

source: Error
ru_ru: Ошибка

source: Success
ru_ru: Успех

source: Info
ru_ru: Информация

source: Restrictive Loading
ru_ru: Ограничительная нагрузка

source: Load the plugin at some specific moment or place.
ru_ru: Загрузите плагин в какой-то определенный момент или в определенном месте.

source: Page(s)
ru_ru: Страница(ы)

source: Leave it empty to load the plugin in all pages
ru_ru: Оставьте его пустым, чтобы загрузить плагин на всех страницах

source: Conditional(s)
ru_ru: Условный(ые)

source: Load the plugin if some specific condition is true, including WooCommerce conditions, like if current page is product page and so on
ru_ru: Загрузите плагин, если какое-то конкретное условие верно, включая условия WooCommerce, например, если текущая страница является страницей продукта и так далее

source: AJAX add to cart notice
ru_ru: Уведомление о добавлении AJAX в корзину

source: By default, WooCommerce doesn't display the notice when a product has been <a href="%s">added to cart via AJAX on archive pages</a>.
ru_ru: По умолчанию WooCommerce не отображает уведомление, когда товар был <a href="%s"> добавлен в корзину через AJAX на страницах архива</a>.

source: Below are the options of how you can enable and setup it.
ru_ru: Ниже приведены варианты того, как вы можете включить и настроить его.

source: Display AJAX add to cart notice
ru_ru: Отобразить уведомление о добавлении в корзину AJAX

source: Notices wrapper - Smart find
ru_ru: Оболочка уведомлений - Умный поиск

source: Try to find the notices wrapper automatically
ru_ru: Попробуйте автоматически найти оболочку уведомлений

source: If it doesn't work, please disable it and use one of the options below.
ru_ru: Если это не работает, пожалуйста, отключите его и используйте один из приведенных ниже вариантов.

source: Notices wrapper - Action hook
ru_ru: Крюк действия с оберткой уведомлений

source: Add the notice wrapper manually using an action hook.
ru_ru: Добавьте оболочку уведомления вручную, используя крючок действия.

source: Notices wrapper - Selector
ru_ru: Селектор - оболочка уведомлений

source: Add the notice wrapper manually by specifying a DOM selector.
ru_ru: Добавьте оболочку уведомления вручную, указав селектор DOM.

source: Probably %s would be a good guess.
ru_ru: Вероятно, % s было бы хорошим предположением.

source: Ignore messages
ru_ru: Игнорировать сообщения

source: Messages or notices that will be ignored and will not be displayed inside the Pop-up.
ru_ru: Сообщения или уведомления, которые будут проигнорированы и не будут отображаться во всплывающем окне.

source: Search method
ru_ru: Способ поиска

source: The method used to check the message
ru_ru: Метод, используемый для проверки сообщения

source: If you only need to check part of the message use "Partial comparison". Use "Full comparison" to check the whole message.
ru_ru: Если вам нужно проверить только часть сообщения, используйте "Частичное сравнение". Используйте "Полное сравнение", чтобы проверить все сообщение целиком.

source: Partial comparison
ru_ru: Частичное сравнение

source: Full comparison
ru_ru: Полное сравнение

source: Regular expression
ru_ru: Обычное выражение

source: Ignored messages
ru_ru: Проигнорированные сообщения

source: "Full comparison" search method requires to add the message here exactly as it is originally, including the HTML
ru_ru: Метод поиска "Полное сравнение" требует добавить сообщение здесь точно так, как оно есть изначально, включая HTML

source: Add multiple messages on pro version. Leave it empty to disable.
ru_ru: Добавьте несколько сообщений в pro версии. Оставьте его пустым, чтобы отключить.

source: Regular expression flags
ru_ru: Флаги регулярных выражений

source: Flags used on Regular Expression
ru_ru: Флаги, используемые в регулярном выражении

source: Requires Regular expression search method
ru_ru: Требуется метод поиска по регулярному выражению

source: Custom style
ru_ru: Пользовательский стиль

source: Style the pop-up using the Customizer.
ru_ru: Оформите всплывающее окно с помощью настройщика.

source: Enable custom style
ru_ru: Включить пользовательский стиль

source: Enable pop-up custom style using the <a href="%s">Customizer</a>
ru_ru: Включите пользовательский стиль всплывающих окон с помощью <a href="%s">настройщика</a>

source: Use Font Awesome
ru_ru: Используйте шрифт Awesome

source: Check if you want to choose icons from FontAwesome
ru_ru: Проверьте, хотите ли вы выбирать иконки из FontAwesome

source: Font Awesome URL
ru_ru: Шрифт Awesome URL

source: Leave it empty if you are already using Font Awesome from somewhere else and do not want to load it twice
ru_ru: Оставьте его пустым, если вы уже используете Font Awesome откуда-то еще и не хотите загружать его дважды

source: HTML template reponsible for displaying the modal
ru_ru: HTML-шаблон, отвечающий за отображение модального

source: Cookies
ru_ru: Куки

source: Notices will be kept in Browser's cookies trying to prevent duplicated messages from being displayed repeatedly inside popups.
ru_ru: Уведомления будут храниться в файлах cookie браузера, чтобы предотвратить повторное отображение дублированных сообщений во всплывающих окнах.

source: Enable
ru_ru: Включить

source: Save messages in Browser's Cookies
ru_ru: Сохраняйте сообщения в файлах cookie браузера

source: Expiration time
ru_ru: Срок годности

source: Time in Hours messages will be kept in Cookies
ru_ru: Время в часах сообщения будут храниться в файлах cookie

source: Message origin
ru_ru: Источник сообщения

source: Type of messages that will be kept on Cookies, static or dynamic, i.e created on ajax
ru_ru: Тип сообщений, которые будут храниться в файлах cookie, статических или динамических, т.е. созданных с помощью ajax

source: Static
ru_ru: Статический

source: Dynamic
ru_ru: Динамический

source: All
ru_ru: Все

source: Audio
ru_ru: Звук

source: Play sounds.
ru_ru: Воспроизводите звуки.

source: Enable audio
ru_ru: Включить аудио

source: Opening
ru_ru: Открытие

source: Sound URL when Pop-up opens
ru_ru: Звуковой URL-адрес при открытии всплывающего окна

source: Closing
ru_ru: Закрытие

source: Sound URL when Pop-up closes
ru_ru: Звуковой URL-адрес при закрытии всплывающего окна

source: Compatibility options
ru_ru: Параметры совместимости

source: Compatibility section
ru_ru: Раздел совместимости

source: Enable compatibility section
ru_ru: Включить раздел совместимости

source: JetWooBuilder For Elementor
ru_ru: JetWooBuilder для Elementor

source: Compatibility with %s plugin.
ru_ru: Совместимость с плагином %s.

source: AJAX add to cart
ru_ru: AJAX добавить в корзину

source: Detect AJAX add to cart
ru_ru: Обнаружение AJAX добавления в корзину

source: Useful for the "AJAX add to cart notice" option.
ru_ru: Полезно для опции "AJAX добавить в корзину уведомление".

source: YITH WooCommerce Points and Rewards
ru_ru: С помощью баллов и вознаграждений WooCommerce

source: Discount
ru_ru: Скидка

source: Allow the discount to be applied inside the pop-up.
ru_ru: Разрешите применить скидку во всплывающем окне.

source: The <a target='_blank' href='%s'>Premium</a> version will unlock a textarea field adding possibility for multiple values
ru_ru: <a target='_blank' href='%s'>Премиум-версия</a> откроет поле textarea, добавляя возможность для нескольких значений

source: Disabled options can be unlocked using the <a href="%s" target="_blank">Pro version</a>
ru_ru: Отключенные опции могут быть разблокированы с помощью <a href="%s" target="_blank">Pro версии</a>

source: Unlock All
ru_ru: Разблокируйте все

source: Pop-up Notices for WooCommerce Pro
ru_ru: Всплывающие уведомления для WooCommerce Pro

source: Disabled options can be unlocked using <a href="%pro_version_url%" target="_blank"><strong>%pro_version_title%</strong></a>
ru_ru: Отключенные опции можно разблокировать с помощью <a href="%pro_version_url%" target="_blank"><strong>%pro_version_title%</strong></a>

source: Upgrade to Pro version
ru_ru: Обновитесь до версии Pro
